app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "fjkghngnhjm"], ["text", "hgjm,kmnb"], ["image", nil], ["created_at", "2020-04-12 20:20:47.256136"], ["updated_at", "2020-04-12 20:20:47.256136"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "image" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image", "Screenshot_from_2020-04-12_13-44-41.png"], ["updated_at", "2020-04-12 20:47:53.214041"], ["id", 3]]
---
  def update
  @article = Article.find(params[:id])

  if @article.update(article_params)